USE KOR_MyBase;

SELECT DISTINCT Заказы.Товар, Товары.Описание
from Товары, Заказы
WHERE Товары.НазваниеТовара in (SElECT Заказы.Товар FROM Заказы) and Товары.НазваниеТовара = Заказы.Товар

SELECT DISTINCT Заказы.Товар, Товары.Описание
from Товары inner join Заказы
on Товары.НазваниеТовара = Заказы.Товар
WHERE Товары.НазваниеТовара in (SElECT Заказы.Товар FROM Заказы)


select Заказы.НомерЧека, Заказы.Товар, Товары.Описание  from Заказы inner join Товары on Заказы.Товар = Товары.НазваниеТовара
inner join Отделы on Заказы.Отдел = Отделы.НазваниеОтдела



SELECT Товар, ПотраченнаяСумма, Отдел 
FROM Заказы Z
WHERE ПотраченнаяСумма = (
    SELECT MAX(ZZ.ПотраченнаяСумма)
    FROM Заказы ZZ
    WHERE Z.Отдел = ZZ.Отдел
)
ORDER BY Отдел, ПотраченнаяСумма DESC;


SELECT * FROM Заказы z
where exists (select z.Товар from Заказы zz where z.Отдел = zz.Отдел)
and z.Отдел in ('Отдел электроники', 'Отдел разработки')

SELECT TOP 1 
(SELECT AVG(ПотраченнаяСумма) FROM Заказы WHERE Отдел LIKE 'Отдел электроники') AS Электроника, 
(SELECT AVG(ПотраченнаяСумма) FROM Заказы WHERE Отдел LIKE 'Отдел разработки') AS Разработчики,
(SELECT AVG(ПотраченнаяСумма) FROM Заказы WHERE Отдел LIKE 'Отдел продаж') AS Продажники
FROM Заказы;



SELECT Z.Товар, Z.ПотраченнаяСумма, Z.Отдел
FROM Заказы Z
WHERE Z.ПотраченнаяСумма >= ALL 
    (SELECT ZZ.ПотраченнаяСумма FROM Заказы ZZ WHERE Z.Отдел = ZZ.Отдел);



SELECT o.НазваниеОтдела, o.ПредельнаяНормаРасхода
from Отделы o
Where o.ПредельнаяНормаРасхода < any (Select Заказы.ПотраченнаяСумма from Заказы where Заказы.Отдел = o.НазваниеОтдела)
group by o.НазваниеОтдела, o.ПредельнаяНормаРасхода